//아래의 pbf파일 텍스트에서 *~* 사이의 텍스트만 추출하여 변수에 저장. 예를들어 배열 1번은 *패스파인더 설정*

var originaltext = `[Bookmark]
0=90442*오빠가 제 친구를 알게 되어*
1=93341*책갈피 2*
2=95141*책갈피 3*
3=96750*책갈피 5*
4=98078*책갈피 7*
5=98440*책갈피 6*
6=100260*오빠가 나를 계속 놀리고*
7=103501*책갈피 8*
8=111100*책갈피 9*
9=115514*책갈피 10*
10=127362*책갈피 11*
11=134409*책갈피 12*
12=135954*책갈피 13*
13=138347*책갈피 14*
14=144348*책갈피 15*
15=157178*책갈피 16*
16=159439*책갈피 17*
17=161691*책갈피 19*
18=163680*책갈피 18*
19=201513*책갈피 20*
20=213332*책갈피 21*
21=


`
var textlists = [];
var reg = /\*.*\*/g;
while((textresult = reg.exec(originaltext)) != null ) {
    textlists.push(textresult[0]); //store the file name into the array files
};
console.log(textlists);